probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    /* Mode button hold tracking (for SEQ_MODE_BOTH) */
    bool drums_btn_held;
    bool keys_btn_held;

    /* Drum fill state (intro / outro) */
    int  fill_steps_remaining; /* > 0 while a fill is playing */
    bool fill_is_outro;        /* true = outro: stop after fill */
    bool fill_outro_done;      /* set by timer; cleared by main-task stop */
    bool fill_outro_pending;   /* wait for next bar boundary, then arm outro */
    bool started_with_fill;    /* this run was started via long-press intro */

    /* Tight voicing (Circle mode) */
    bool    tight_voicing;           /* true = close-position (default) */
    uint8_t tight_prev_notes[12];    /* MIDI notes of last voiced chord */
    int     tight_prev_count;        /* count of notes in tight_prev_notes */

    /* Inversion window offset (Circle mode) — controls octave/voicing of played chords */
    int8_t  inversion_offset;        /* -12 to +12 semitones via inversions; affects base_octave for bar chords */

    /* Button hold tracking (UP/DOWN for long-press BPM vs short-press inversion) */
    uint64_t up_btn_press_time;      /* timestamp when UP button was pressed */
    uint64_t down_btn_press_time;    /* timestamp when DOWN button was pressed */
    
    /* Thread safety */
    portMUX_TYPE mux;
} seq_state_t;

static seq_state_t s_seq;

/* Live "hold while pressed" state for the lower half of Circle mode (rows 5-8).
 * We track the exact MIDI notes that were turned on so release sends precise note-offs. */
static struct {
    uint8_t notes[12];
    int     note_count;
} s_circle_lower_hold = {};

/* Range-fill gesture: when a second step pad is pressed while the first is still held,
 * all steps between them are set to the same state as the first toggle determined.
 * In melodic mode supports both horizontal (same row, vary columns) and vertical
 * (same column, vary rows) fills without affecting notes in between. */
static struct {
    bool active;
    int  first_step;  /* linear step index (drum/chord-seq) or col-1 (melodic) */
    int  first_row;   /* row of first pad (used in melodic for pitch) */
    int  first_col;   /* column of first pad (used in melodic to detect vertical fill) */
    bool fill_on;     /* true = filling steps ON; false = turning them OFF */
} s_range_fill = {};

/* Per-raw-note remap table for external MIDI in FIELD mode.
 * Stores the quantized note that was actually started for each incoming note,
 * so note-offs are always sent to the correct playing voice even if the
 * harmonic state changes between press and release. */
static uint8_t s_field_note_map[128] = {};

/* Returns true if `note` is currently pressed by the user (Launchpad FIELD pad
 * or external MIDI keyboard).  Any MIDI note-off guarded by this check will
 * be skipped so that automatic chord transitions never cut a user-held note.
 * In non-FIELD mode the remap table stores raw→raw for keyboard notes, so
 * keyboard notes remain visible regardless of the current sequencer mode. */
static bool is_user_held(uint8_t note)
{
    /* Launchpad FIELD pad notes */
    for (int i = 0; i < 64; i++) {
        if (s_seq.field_notes[i].active && s_seq.field_notes[i].note == note)
            return true;
    }
    /* External MIDI keyboard notes (values in the remap table) */
    for (int i = 0; i < 128; i++) {
        if (s_field_note_map[i] != 0 && s_field_note_map[i] == note)
            return true;
    }
    return false;
}

/* ================================================
 * Timer helpers
 * ================================================ */

static uint64_t step_period_us(uint16_t bpm)
{
    /* 16th note period = 60,000,000 / (bpm * 4) microseconds */
    return 60000000ULL / ((uint64_t)bpm * 4);
}

/* ================================================
 * MIDI routing: drums → TSF when loaded, else Dexed
 * ================================================ */

/* Channel marker: active_notes[].channel == 9 means the note was sent to TSF. */
#define SEQ_CH_TSF  9
#define SEQ_CH_DEX  0

static inline void seq_drum_note_on(uint8_t note, uint8_t vel)
{
    /* Reduce drum volume by 50% in the mix */
    uint8_t drum_vel = (uint8_t)((vel * 50) / 100);
    if (drum_vel < 1) drum_vel = 1;
    
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x99, note, drum_vel);  /* channel 9 */
    } else {
        dexed_raw_handle_midi(0x90, note, drum_vel);
    }
}

static inline void seq_drum_note_off(uint8_t note)
{
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi(0x80, note, 0);
    }
}

/* Send Note Off to the correct engine based on stored channel marker. */
static inline void seq_note_off_routed(uint8_t channel, uint8_t note)
{
    if (channel == SEQ_CH_TSF) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi((uint8_t)(0x80 | channel), note, 0);
    }
}

/* ================================================
 * Timer callback -- called from esp_timer task (Core 0)
 * ================================================ */

/* Long-press tracking for SESSION button (main-task read only outside ISR) */
static volatile int64_t s_session_press_us = 0;
#define SESSION_LONG_PRESS_US  500000LL   /* 500 ms */

/* ---- Drum fill patterns (16 steps each) ----
 * Each row: drum-track index, intro velocities, outro velocities.
 * Intro: builds up into the groove (crash on beat 1, kick on quarters, snare
 *        roll at end).  Outro: snare roll building to crash on final step. */
#define FILL_PATTERN_LEN 16
struct fill_entry { int idx; uint8_t in_v[16]; uint8_t out_v[16]; };
static const fill_entry s_fill_patterns[] = {
    { 0,  /* kick */
      {100,0,0,0,100,0,0,0,100,0,0,0,100,0,0,  0},
      {100,0,0,0,  0,0,0,0,100,0,0,0,  0,0,0,  0} },
    { 2,  /* snare */
      {  0,0,0,0, 80,0,0,0,  0,0,0,0, 90,90,100,100},
      {  0,0,80,70,80,70,80,70,  0,70,80,90,100,100,100,  0} },
    { 6,  /* closed hi-hat */
      { 60,60,60,60, 60,60,60,60, 80,80,80,80,  0, 0, 0,  0},
      { 70,70,70,70, 70,70,70,70, 80,80,80,90,  0, 0, 0,  0} },
    { 13, /* crash cymbal (GM note 49) */
      { 90, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0,  0},
      {  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0,100} },
};
