probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
#define FILL_NUM_TRACKS 4

/* ---------------------------------------------------------------------------
 * voice_tight_notes — close-position chord voicing
 *
 * Given a chord mask (bits 0-11 = semitones above root) and the absolute
 * root pitch class, positions each note as close as possible to the centroid
 * of the previous chord (default A3=57 when no prev).  Output notes are in
 * MIDI range 24-108.
 * -------------------------------------------------------------------------*/
static void voice_tight_notes(uint16_t mask, uint8_t abs_root,
                               const uint8_t *prev, int prev_cnt,
                               uint8_t *out, int *out_cnt)
{
    uint8_t classes[12]; int n = 0;
    for (int i = 0; i < 12; i++)
        if ((mask >> i) & 1) classes[n++] = (uint8_t)((abs_root + i) % 12);
    int center = 69;  /* A4 default — one octave above previous A3 centre */
    if (prev_cnt > 0) {
        int sum = 0;
        for (int i = 0; i < prev_cnt; i++) sum += prev[i];
        center = sum / prev_cnt;
        /* Constrain center to a stable range (C3-C6) to prevent octave drift */
        if (center < 48)  center = 48;
        if (center > 84)  center = 84;
    }
    int cnt = 0;
    for (int i = 0; i < n; i++) {
        int pc = (int)classes[i];
        int note = pc + ((center - pc + 6) / 12) * 12;
        while (note < 36)  note += 12;
        while (note > 120) note -= 12;
        out[cnt++] = (uint8_t)note;
    }
    *out_cnt = cnt;
}

static void seq_timer_callback(void *arg)
{
    seq_state_t *s = (seq_state_t *)arg;

    portENTER_CRITICAL(&s->mux);

    /* Guard: outro fill has finished — wait for main task to call stop */
    if (s->fill_outro_done) {
        portEXIT_CRITICAL(&s->mux);
        return;
    }

    /* 1. Note Off for all currently sounding step notes (NOT bar chord notes) */
    for (int i = 0; i < s->active_note_count; i++) {
        seq_note_off_routed(s->active_notes[i].channel, s->active_notes[i].note);
    }
    s->active_note_count = 0;

    /* 2. Advance playhead */
    s->current_step = (s->current_step + 1) % s->num_steps;
    int step = s->current_step;

    /* Arm pending outro at the start of the next bar */
    if (s->fill_outro_pending && step == 0 && s->fill_steps_remaining == 0) {
        s->fill_outro_pending   = false;
        s->fill_is_outro        = true;
        s->fill_outro_done      = false;
        s->fill_steps_remaining = s->num_steps;
        /* Silence all sounding notes immediately so only the fill plays */
        for (int i = 0; i < s->bar_chord_note_count; i++) {
            if (s->bar_chord_notes[i].active) {
                dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                s->bar_chord_notes[i].active = false;
            }
        }
        s->bar_chord_note_count = 0;
        for (int i = 0; i < s->active_note_count; i++)
            seq_note_off_routed(s->active_notes[i].channel, s->active_notes[i].note);
        s->active_note_count = 0;
    }

    /* 3. At each quarter-note boundary (every 4 steps): advance chord sequencer or bar chord.
     * Skipped during outro fill so no new notes are triggered. */
    if (step % 4 == 0 && s->playing && !s->fill_is_outro) {
        /* Advance chord-seq playhead independently (0-31 over 4 drum loops) */
        s->chord_seq_step = (s->chord_seq_step < 0) ? 0 : (s->chord_seq_step + 1) % 32;
        int q = s->chord_seq_step;

        /* Check whether the chord step sequencer has any programmed steps */
        bool chord_seq_has_steps = false;
        for (int i = 0; i < 32; i++) {
            if (s->chord_seq_steps[i].active) { chord_seq_has_steps = true; break; }
        }

        uint8_t play_root = 0xFF;   /* 0xFF = no chord this quarter */
        chord_type_t play_type = CHORD_MAJ;

        if (chord_seq_has_steps) {
            if (s->chord_seq_steps[q].active) {
                play_root = s->chord_seq_steps[q].chord_root;
                play_type = s->chord_seq_steps[q].chord_type;
            }
        } else if (step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop (only when no chord seq programmed) */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        /* At every quarter boundary that belongs to the chord sequencer, stop the previous
         * chord ONLY when a new chord is about to play — this gives legato sustain across
         * empty steps so chords ring until the next programmed step. */
        if (!chord_seq_has_steps && step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        if (play_root != 0xFF) {
            /* Stop previous bar chord notes now that a new one is starting */
            for (int i = 0; i < s->bar_chord_note_count; i++) {
                if (s->bar_chord_notes[i].active) {
                    if (!is_user_held(s->bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                    s->bar_chord_notes[i].active = false;
                }
            }
            s->bar_chord_note_count = 0;
            /* Update harmonic state so FIELD page + suggestion engine reflect the new chord */
            uint8_t abs_old = (s->harmonic.key + s->harmonic.chord_root) % 12;
            s->harmonic.prev_chord_root = abs_old;
            s->harmonic.prev_chord_type = s->harmonic.chord_type;
            s->harmonic.has_prev_chord  = true;
            s->harmonic.chord_root = (play_root - s->harmonic.key + 12) % 12;
            s->harmonic.chord_type = play_type;

            /* Keep held_chord in sync so the Circle display stays coherent */
            if (chord_seq_has_steps) {
                s->held_chord.chord_root = play_root;
                s->held_chord.chord_type = play_type;
                s->held_chord.active     = true;
            }

            /* Play new chord notes (legato — sustains until next chord trigger)
             * Apply inversion_offset to shift voicing. */
            uint16_t mask = chord_masks[play_type];
            if (s->tight_voicing) {
                uint8_t tnotes[12]; int tcnt = 0;
                /* Apply inversion offset by adjusting the voicing center */
                int center = 69;  /* A4 default */
                if (s->tight_prev_count > 0) {
                    int sum = 0;
                    for (int i = 0; i < s->tight_prev_count; i++) sum += s->tight_prev_notes[i];
                    center = sum / s->tight_prev_count;
                }
                center += s->inversion_offset;  /* Apply inversion window shift */
                
