probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
                /* Manually voice with adjusted center */
                uint8_t classes[12]; int n = 0;
                for (int i = 0; i < 12; i++)
                    if ((mask >> i) & 1) classes[n++] = (uint8_t)((play_root + i) % 12);
                
                int cnt = 0;
                for (int i = 0; i < n; i++) {
                    int pc = (int)classes[i];
                    int note = pc + ((center - pc + 6) / 12) * 12;
                    while (note < 36)  note += 12;
                    while (note > 120) note -= 12;
                    tnotes[cnt++] = (uint8_t)note;
                }
                tcnt = cnt;
                
                for (int i = 0; i < tcnt && s->bar_chord_note_count < 12; i++) {
                    uint8_t note = tnotes[i];
                    if (note <= 127) {
                        dexed_raw_handle_midi(0x90, note, 64);
                        s->bar_chord_notes[s->bar_chord_note_count].note   = note;
                        s->bar_chord_notes[s->bar_chord_note_count].active = true;
                        s->bar_chord_note_count++;
                    }
                }
            } else {
                /* Free voicing: apply inversion offset to base note */
                int base_note_int = (s->base_octave + 4) * 12 + play_root + s->inversion_offset;
                if (base_note_int < 0) base_note_int = 0;
                if (base_note_int > 127) base_note_int = 127;
                uint8_t base_note = (uint8_t)base_note_int;
                
                for (int i = 0; i < 12 && s->bar_chord_note_count < 12; i++) {
                    if ((mask >> i) & 1) {
                        int note_int = base_note + i;
                        if (note_int > 127) break;
                        uint8_t note = (uint8_t)note_int;
                        if (note <= 127) {
                            dexed_raw_handle_midi(0x90, note, 64);   /* 50% velocity */
                            s->bar_chord_notes[s->bar_chord_note_count].note   = note;
                            s->bar_chord_notes[s->bar_chord_note_count].active = true;
                            s->bar_chord_note_count++;
                        }
                    }
                }
            }
            /* Update tight voicing centroid — but only if no inversion offset is applied.
             * When offset is active, reset centroid so each chord is independently positioned,
             * preventing cumulative shifting across multiple chords. */
            if (s->inversion_offset == 0) {
                s->tight_prev_count = s->bar_chord_note_count;
                for (int i = 0; i < s->bar_chord_note_count; i++)
                    s->tight_prev_notes[i] = s->bar_chord_notes[i].note;
            } else {
                /* Reset centroid when offset is active to prevent accumulation */
                s->tight_prev_count = 0;
            }
        }
    }

    /* 4. Trigger notes at current step.
     * Playback is always active regardless of display mode — mode only controls
     * which page is shown on the Launchpad, not which tracks fire. */

    /* Fill intercept: play fill patterns instead of programmed tracks */
    if (s->fill_steps_remaining > 0) {
        int fi_step = step % FILL_PATTERN_LEN;
        for (int fi = 0; fi < FILL_NUM_TRACKS; fi++) {
            uint8_t vel = s->fill_is_outro
                        ? s_fill_patterns[fi].out_v[fi_step]
                        : s_fill_patterns[fi].in_v[fi_step];
            if (vel > 0)
                seq_drum_note_on(drum_midi_notes[s_fill_patterns[fi].idx], vel);
        }
        s->fill_steps_remaining--;
        if (s->fill_steps_remaining == 0) {
            if (s->fill_is_outro) {
                /* Stop all notes and signal main task to call step_seq_stop() */
                for (int i = 0; i < s->active_note_count; i++)
                    seq_note_off_routed(s->active_notes[i].channel,
                                        s->active_notes[i].note);
                s->active_note_count = 0;
                for (int i = 0; i < s->bar_chord_note_count; i++) {
                    if (s->bar_chord_notes[i].active) {
                        dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                        s->bar_chord_notes[i].active = false;
                    }
                }
                s->bar_chord_note_count = 0;
                /* Signal main task to call step_seq_stop() — do NOT set playing=false
                 * here; step_seq_stop() must do it so the timer gets cancelled. */
                s->fill_outro_done = true;
            }
            /* Intro fill done: normal playback resumes from next tick */
        }
        portEXIT_CRITICAL(&s->mux);
        return;
    }

    for (int d = 0; d < SEQ_NUM_DRUM_TRACKS; d++) {
        uint8_t vel = s->drum_tracks[d].steps[step].velocity;
        if (vel > 0) {
            seq_drum_note_on(drum_midi_notes[d], vel);
            /* Drum notes NOT tracked in active_notes[]: sample engine handles
             * its own decay; note-off on next tick would cut samples short. */
        }
    }
    {
        seq_melodic_step_t *ms = &s->melodic_steps[step];
        for (int n = 0; n < ms->note_count && s->active_note_count < SEQ_ACTIVE_NOTES_MAX; n++) {
            if (ms->notes[n] > 0) {
                dexed_raw_handle_midi(0x90, ms->notes[n], ms->velocities[n]);
                s->active_notes[s->active_note_count].note    = ms->notes[n];
                s->active_notes[s->active_note_count].channel = 0;
                s->active_note_count++;
            }
        }
    }

    /* Lookahead for FIELD display: switch the display chord SEQ_FIELD_LOOKAHEAD_MS
     * before it actually plays.  Comparison is in µs so the window is a fixed
     * wall-clock duration, fully independent of BPM. */
    s->display_harmonic = s->harmonic;
    if (s->playing && s->chord_seq_step >= 0) {
        uint64_t period_us          = step_period_us(s->bpm);
        int      steps_to_next      = 4 - (step % 4);          /* 1-4 steps until next quarter */
        uint64_t time_to_next_us    = (uint64_t)steps_to_next * period_us;
        if (time_to_next_us <= (uint64_t)SEQ_FIELD_LOOKAHEAD_MS * 1000ULL) {
            int next_q = (s->chord_seq_step + 1) % 32;
            if (s->chord_seq_steps[next_q].active) {
                s->display_harmonic.chord_root =
                    (s->chord_seq_steps[next_q].chord_root - s->harmonic.key + 12) % 12;
                s->display_harmonic.chord_type = s->chord_seq_steps[next_q].chord_type;
            }
        }
    }

