probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    portEXIT_CRITICAL(&s->mux);

    /* 5. Update Launchpad display (outside critical section) */
    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

/* ================================================
 * Public API: init / deinit
 * ================================================ */

int step_seq_init(void)
{
    memset(&s_seq, 0, sizeof(s_seq));
    s_seq.mux = portMUX_INITIALIZER_UNLOCKED;
    s_seq.bpm = SEQ_DEFAULT_BPM;
    s_seq.num_steps = SEQ_MAX_STEPS;
    s_seq.current_step = -1;
    s_seq.current_velocity = SEQ_DEFAULT_VELOCITY;
    s_seq.base_octave = 3;  /* C3 = MIDI 60 */

    /* Initialize harmonic state */
    s_seq.harmonic.key = 0;         /* C */
    s_seq.harmonic.chord_root = 0;  /* Tonic */
    s_seq.harmonic.chord_type = CHORD_MAJ;
    s_seq.harmonic.scale_type = SCALE_MAJOR;
    s_seq.harmonic.tension = 0;
    s_seq.harmonic.prev_chord_root = 0;
    s_seq.harmonic.prev_chord_type = CHORD_MAJ;
    s_seq.harmonic.has_prev_chord = false;
    s_seq.display_harmonic = s_seq.harmonic; /* starts identical */

    /* Initialize held chord tracking */
    s_seq.held_chord.chord_root = 0;
    s_seq.held_chord.chord_type = CHORD_MAJ;
    s_seq.held_chord.active = false;
    s_seq.held_chord.bar_chord_played = false;

    /* Tight voicing defaults */
    s_seq.tight_voicing    = true;
    s_seq.tight_prev_count = 0;

    /* Initialize inversion window and button tracking */
    s_seq.inversion_offset = 0;
    s_seq.up_btn_press_time = 0;
    s_seq.down_btn_press_time = 0;

    /* Initialize field notes tracking */
    for (int i = 0; i < 64; i++) {
        s_seq.field_notes[i].note = 0;
        s_seq.field_notes[i].active = false;
    }

    /* Initialize chord step sequencer */
    for (int i = 0; i < 32; i++) {
        s_seq.chord_seq_steps[i].chord_root = 0;
        s_seq.chord_seq_steps[i].chord_type = CHORD_MAJ;
        s_seq.chord_seq_steps[i].active = false;
    }
    s_seq.chord_seq_step = -1;
    s_seq.selected_chord_root = 0;
    s_seq.selected_chord_type = CHORD_MAJ;
    s_seq.has_selected_chord  = false;

    esp_timer_create_args_t timer_args = {
        .callback = seq_timer_callback,
        .arg = &s_seq,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "step_seq",
        .skip_unhandled_events = true,
    };

    esp_err_t err = esp_timer_create(&timer_args, &s_seq.timer);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create sequencer timer: %s", esp_err_to_name(err));
        return -1;
    }

    launchpad_init();

    ESP_LOGI(TAG, "Step sequencer initialized (BPM=%d, steps=%d)",
             s_seq.bpm, s_seq.num_steps);
    return 0;
}

void step_seq_deinit(void)
{
    step_seq_stop();
    if (s_seq.timer) {
        esp_timer_delete(s_seq.timer);
        s_seq.timer = NULL;
    }
}

/* ================================================
 * Transport
 * ================================================ */

void step_seq_play(void)
{
    if (s_seq.playing) return;
    s_seq.playing = true;
    s_seq.current_step = -1;  /* will advance to 0 on first tick */
    uint64_t period = step_period_us(s_seq.bpm);
    esp_timer_start_periodic(s_seq.timer, period);
    ESP_LOGI(TAG, "Sequencer started (BPM=%d, period=%llu us)",
             s_seq.bpm, (unsigned long long)period);
    esp32_oled_show_transport(true);

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_stop(void)
{
    if (!s_seq.playing) return;
    esp_timer_stop(s_seq.timer);
    s_seq.playing          = false;
    s_seq.started_with_fill = false;
    s_seq.fill_outro_pending = false;

    /* All notes off */
    portENTER_CRITICAL(&s_seq.mux);
    for (int i = 0; i < s_seq.active_note_count; i++) {
        seq_note_off_routed(s_seq.active_notes[i].channel, s_seq.active_notes[i].note);
    }
    s_seq.active_note_count = 0;
    
    /* Turn off bar chord notes */
    for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
        if (s_seq.bar_chord_notes[i].active) {
            dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
            s_seq.bar_chord_notes[i].active = false;
        }
    }
    s_seq.bar_chord_note_count = 0;
    
    s_seq.current_step = -1;
    s_seq.chord_seq_step = -1;
    portEXIT_CRITICAL(&s_seq.mux);

    ESP_LOGI(TAG, "Sequencer stopped");
    esp32_oled_show_transport(false);

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_toggle_play(void)
{
    if (s_seq.playing) {
        step_seq_stop();
    } else {
        step_seq_play();
    }
}

bool step_seq_is_playing(void)
{
    return s_seq.playing;
}

bool step_seq_consume_outro_fill_done(void)
{
    if (!s_seq.fill_outro_done) return false;
    s_seq.fill_outro_done = false;
    return true;
}

/* ================================================
 * Mode
 * ================================================ */

void step_seq_set_mode(seq_mode_t mode)
{
    s_seq.mode = mode;
    
    static const char* mode_names[] = {
        "DRUM", "MELODIC", "BOTH", "CIRCLE", "FIELD"
    };
    ESP_LOGI(TAG, "Mode: %s", mode_names[mode]);
    esp32_oled_show_mode((int)mode);

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

seq_mode_t step_seq_get_mode(void)
{
    return s_seq.mode;
}

/* ================================================
 * BPM
 * ================================================ */

void step_seq_set_bpm(uint16_t bpm)
{
    if (bpm < SEQ_MIN_BPM) bpm = SEQ_MIN_BPM;
    if (bpm > SEQ_MAX_BPM) bpm = SEQ_MAX_BPM;
    s_seq.bpm = bpm;

    if (s_seq.playing) {
        esp_timer_restart(s_seq.timer, step_period_us(bpm));
    }
    ESP_LOGI(TAG, "BPM: %d", bpm);
    esp32_oled_show_bpm(bpm);
}

void step_seq_adjust_bpm(int16_t delta)
{
    int new_bpm = (int)s_seq.bpm + delta;
    step_seq_set_bpm((uint16_t)(new_bpm < SEQ_MIN_BPM ? SEQ_MIN_BPM :
                                 (new_bpm > SEQ_MAX_BPM ? SEQ_MAX_BPM : new_bpm)));
}

uint16_t step_seq_get_bpm(void)
{
    return s_seq.bpm;
}

/* ================================================
 * Drum mode operations
 * ================================================ */

void step_seq_select_drum(uint8_t drum_index)
{
    if (drum_index >= SEQ_NUM_DRUM_TRACKS) return;
    s_seq.selected_drum = drum_index;
}

uint8_t step_seq_get_selected_drum(void)
{
    return s_seq.selected_drum;
}

void step_seq_drum_toggle_step(uint8_t step)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    uint8_t *vel = &s_seq.drum_tracks[s_seq.selected_drum].steps[step].velocity;
    if (*vel > 0) {
        *vel = 0;
    } else {
        *vel = s_seq.current_velocity;
    }
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_drum_set_step(uint8_t step, uint8_t velocity)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    s_seq.drum_tracks[s_seq.selected_drum].steps[step].velocity = velocity;
    portEXIT_CRITICAL(&s_seq.mux);
}

void step_seq_drum_clear_step(uint8_t step)
{
    step_seq_drum_set_step(step, 0);
}

/* ================================================
 * Velocity
 * ================================================ */

void step_seq_set_velocity(uint8_t velocity)
{
    if (velocity < 1) velocity = 1;
    if (velocity > 127) velocity = 127;
    s_seq.current_velocity = velocity;
    ESP_LOGD(TAG, "Velocity: %d", velocity);
}

uint8_t step_seq_get_velocity(void)
{
    return s_seq.current_velocity;
}

/* ================================================
 * Melodic mode operations
 * ================================================ */

void step_seq_melodic_toggle_note(uint8_t step, uint8_t midi_note, uint8_t velocity)
{
    if (step >= SEQ_MAX_STEPS) return;
    portENTER_CRITICAL(&s_seq.mux);
    seq_melodic_step_t *ms = &s_seq.melodic_steps[step];

