probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
/* Q1/Q2 pad → step index (Drum mode) */
static int grid_to_step_index(uint8_t row, uint8_t col)
{
    if (row < 5 || row > 8 || col < 1 || col > 8) return -1;
    return (8 - row) * 8 + (col - 1);
}

/* Q3 pad → drum index */
static int q3_to_drum_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 1 || col > 4) return -1;
    return (row - 1) * 4 + (col - 1);
}

/* Q4 pad → velocity index */
static int q4_to_velocity_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 5 || col > 8) return -1;
    return (row - 1) * 4 + (col - 5);
}

/* Velocity levels for Q4 */
static const uint8_t velocity_levels[16] = {
    8, 16, 24, 32, 40, 48, 56, 64,
    72, 80, 88, 96, 104, 112, 120, 127
};

/* ================================================
 * Input handlers (called from launchpad.cpp)
 * ================================================ */

void step_seq_handle_grid_press(uint8_t row, uint8_t col, uint8_t velocity)
{
    if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Step grid: simple toggle */
            int step = grid_to_step_index(row, col);
            if (step >= 0 && step < s_seq.num_steps) {
                step_seq_drum_toggle_step((uint8_t)step);
            }
        }
        else if (lp_is_q3(row, col)) {
            /* Drum pad selection + audition.
             * On pressure-sensitive pads (Launchpad X) adopt the actual played
             * velocity as the new current velocity so the next programmed step
             * uses it too.  A pad reporting exactly 64 is almost certainly a
             * fixed-velocity device — keep the existing velocity in that case. */
            int drum = q3_to_drum_index(row, col);
            if (drum >= 0 && drum < SEQ_NUM_DRUM_TRACKS) {
                step_seq_select_drum((uint8_t)drum);
                uint8_t v = (velocity > 0 && velocity != 64)
                            ? velocity
                            : s_seq.current_velocity;
                if (v != s_seq.current_velocity) step_seq_set_velocity(v);
                /* Audition: trigger the drum sound at played velocity */
                seq_drum_note_on(drum_midi_notes[drum], v);
            }
        }
        else if (lp_is_q4(row, col)) {
            /* Velocity selection grid — fixed preset levels per cell */
            int vel_idx = q4_to_velocity_index(row, col);
            if (vel_idx >= 0 && vel_idx < 16) {
                step_seq_set_velocity(velocity_levels[vel_idx]);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_MELODIC) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Melodic step grid: columns=time, rows=pitch */
            int step = (col - 1);  /* 0-7 */
            uint8_t pitch = (uint8_t)(s_seq.base_octave * 12 + (row - 5));
            step_seq_melodic_toggle_note((uint8_t)step, pitch, s_seq.current_velocity);
        }
        else if (lp_is_q3(row, col) || lp_is_q4(row, col)) {
            /* Keyboard: play note live */
            uint8_t base = s_seq.base_octave * 12;
            int offset;
            if (col <= 4) {
                offset = (row - 1) * 4 + (col - 1);
            } else {
                offset = 16 + (row - 1) * 4 + (col - 5);
            }
            uint8_t note = (uint8_t)(base + offset);
            if (note <= 127) {
                dexed_raw_handle_midi(0x90, note, velocity);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_CIRCLE) {
        /* Circle mode: 9 chord pads (7 diatonic + bVI borrowed + major III) */
        uint8_t chord_root; chord_type_t chord_type;
        if (lp_is_grid(row, col) && row <= 3 &&
            get_circle_chord(row, col, s_seq.harmonic.key, &chord_root, &chord_type)) {

            /* Stop any previously held notes — but never cut a user-held note */
            for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                if (!is_user_held(s_circle_lower_hold.notes[i]))
                    dexed_raw_handle_midi(0x80, s_circle_lower_hold.notes[i], 0);
            s_circle_lower_hold.note_count = 0;
            /* Also clear bar-chord notes fired by the timer */
            portENTER_CRITICAL(&s_seq.mux);
            for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
                if (s_seq.bar_chord_notes[i].active) {
                    if (!is_user_held(s_seq.bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
                    s_seq.bar_chord_notes[i].active = false;
                }
            }
            s_seq.bar_chord_note_count = 0;
            portEXIT_CRITICAL(&s_seq.mux);

            /* Save previous chord for suggestion engine */
            uint8_t abs_old = (s_seq.harmonic.key + s_seq.harmonic.chord_root) % 12;
            s_seq.harmonic.prev_chord_root = abs_old;
            s_seq.harmonic.prev_chord_type = s_seq.harmonic.chord_type;
            s_seq.harmonic.has_prev_chord = true;

            /* Update harmonic state to new chord */
            s_seq.harmonic.chord_root = (chord_root - s_seq.harmonic.key + 12) % 12;
            s_seq.harmonic.chord_type = chord_type;

            /* Sync display harmonic state so OLED shows the chord immediately */
            s_seq.display_harmonic = s_seq.harmonic;

            /* Track last manually-selected chord for step assignment */
            s_seq.selected_chord_root = chord_root;
            s_seq.selected_chord_type = chord_type;
            s_seq.has_selected_chord  = true;

            /* Play and record exact notes — stopped precisely on pad release.
             * Suppress note-on during an intro drum fill; the chord is already
             * stored in harmonic state and will fire on the next quarter-note.
             * Apply inversion_offset to shift voicing up/down by semitones. */
            bool intro_running = s_seq.playing
                                 && s_seq.fill_steps_remaining > 0
                                 && !s_seq.fill_is_outro;
            if (!intro_running) {
                uint16_t mask = chord_masks[chord_type];
                if (s_seq.tight_voicing) {
                    uint8_t tnotes[12]; int tcnt = 0;
                    /* Apply inversion offset by adjusting the voicing center */
                    int center = 69;  /* A4 default */
                    if (s_seq.tight_prev_count > 0) {
                        int sum = 0;
                        for (int i = 0; i < s_seq.tight_prev_count; i++) sum += s_seq.tight_prev_notes[i];
                        center = sum / s_seq.tight_prev_count;
                    }
                    center += s_seq.inversion_offset;  /* Apply inversion window shift */
                    
                    /* Manually voice with adjusted center (avoiding voice_tight_notes call) */
                    uint8_t classes[12]; int n = 0;
                    for (int i = 0; i < 12; i++)
                        if ((mask >> i) & 1) classes[n++] = (uint8_t)((chord_root + i) % 12);
                    
                    int cnt = 0;
                    for (int i = 0; i < n; i++) {
                        int pc = (int)classes[i];
                        int note = pc + ((center - pc + 6) / 12) * 12;
                        while (note < 36)  note += 12;
                        while (note > 120) note -= 12;
                        tnotes[cnt++] = (uint8_t)note;
                    }
                    tcnt = cnt;
                    
                    for (int i = 0; i < tcnt; i++) {
                        uint8_t n = tnotes[i];
                        if (n <= 127 && s_circle_lower_hold.note_count < 12) {
                            dexed_raw_handle_midi(0x90, n, velocity);
                            s_circle_lower_hold.notes[s_circle_lower_hold.note_count++] = n;
                        }
                    }
                } else {
                    /* Free voicing: apply inversion offset to base note */
                    int base_note_int = (s_seq.base_octave + 4) * 12 + chord_root + s_seq.inversion_offset;
                    if (base_note_int < 0) base_note_int = 0;
                    if (base_note_int > 127) base_note_int = 127;
                    uint8_t base_note = (uint8_t)base_note_int;
                    
                    for (int i = 0; i < 12; i++) {
                        if ((mask >> i) & 1) {
                            int n_int = base_note + i;
                            if (n_int > 127) break;
                            uint8_t n = (uint8_t)n_int;
                            if (n <= 127 && s_circle_lower_hold.note_count < 12) {
                                dexed_raw_handle_midi(0x90, n, velocity);
                                s_circle_lower_hold.notes[s_circle_lower_hold.note_count++] = n;
                            }
                        }
                    }
                }
                /* Update tight voicing centroid — but only if no inversion offset is applied.
                 * When offset is active, reset centroid so each chord is independently positioned,
                 * preventing cumulative shifting across multiple chords. */
                if (s_seq.inversion_offset == 0) {
                    s_seq.tight_prev_count = s_circle_lower_hold.note_count;
                    for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                        s_seq.tight_prev_notes[i] = s_circle_lower_hold.notes[i];
                } else {
                    /* Reset centroid when offset is active to prevent accumulation */
                    s_seq.tight_prev_count = 0;
                }
            }

            ESP_LOGI(TAG, "Circle: %s%s (hold-while-pressed) (prev %s)",
                     note_names[chord_root], chord_type_names[chord_type],
                     s_seq.harmonic.has_prev_chord ? note_names[abs_old] : "none");

